Revit 2027 API
ZoneGeometricDefinition Enumeration
 An enumerated type listing possible geometric definition types for generic zones.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ZoneGeometricDefinition
Public Enumeration ZoneGeometricDefinition
public enum class ZoneGeometricDefinition
type ZoneGeometricDefinition
Members
Member name | Value | Description
Sketch | 0 |  The zone geometry is defined by a sketch linework.
Spaces | 2 |  The zone geometry is defined by a selection of MEP spaces.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace